#
# user core constraints
#
# put your clock groups in here as well as any net assignments
#

set CLK_96M {ic|mp1|pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}

# PicoRV32 internal clock pulse (96MHz / 12 ~= 8MHz effective).
# It is generated in softcpu_subsystem.sv and used as a local clock.
create_clock -name clk_pico -period 125.000 \
 [get_nets {core_top:ic|softcpu_subsystem:softcpu_subsystem|clk_pico}]

set_clock_groups -asynchronous \
 -group { bridge_spiclk } \
 -group { clk_74a } \
 -group { clk_74b } \
 -group { clk_pico } \
 -group { ic|mp1|pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk } \
 -group { ic|mp1|pll_inst|altera_pll_i|general[1].gpll~PLL_OUTPUT_COUNTER|divclk } \
 -group { ic|mp1|pll_inst|altera_pll_i|general[2].gpll~PLL_OUTPUT_COUNTER|divclk }

# SDRAM I/O timing constraints
# Target: AS4C32M16MSA-6BIN on Analogue Pocket
# SDRAM chip clock generated by altddio_out in sdram.sv (~180° phase shift)
# Values from Analogue-Amiga core (proven on same hardware and SDRAM chip)
set_input_delay  -clock $CLK_96M -reference_pin [get_ports {dram_clk}] -max 5.9 [get_ports {dram_dq[*]}]
set_input_delay  -clock $CLK_96M -reference_pin [get_ports {dram_clk}] -min 0.9 [get_ports {dram_dq[*]}]
set_output_delay -clock $CLK_96M -reference_pin [get_ports {dram_clk}] -max 2.0 [get_ports {dram_a[*] dram_ba[*] dram_ras_n dram_cas_n dram_we_n dram_cke dram_dqm[*] dram_dq[*]}]
set_output_delay -clock $CLK_96M -reference_pin [get_ports {dram_clk}] -min -1.0 [get_ports {dram_a[*] dram_ba[*] dram_ras_n dram_cas_n dram_we_n dram_cke dram_dqm[*] dram_dq[*]}]

# Non-timed bridge and scaler I/O ports.
set_false_path -from [get_ports {bridge_1wire bridge_spimiso bridge_spimosi bridge_spiss}]
set_false_path -to [get_ports {bridge_1wire bridge_spimiso bridge_spimosi}]
set_false_path -to [get_ports {scal_auddac scal_audlrck scal_audmclk scal_clk scal_de scal_hs scal_skip scal_vid[*] scal_vs}]

# T80 core runs from clk_sys but advances on divided enables (CEN/CEN_n),
# so T80 internal register-to-register paths are multi-cycle relative to
# the 96 MHz system clock.
set T80_REGS [get_registers {core_top:ic|T8080se:cpu_z80|T80:u0|*}]
set_multicycle_path 4 -setup -from $T80_REGS -to $T80_REGS
set_multicycle_path 3 -hold  -from $T80_REGS -to $T80_REGS
